testing/jmeter/reports/report-klien-5vu/statistics.json
{
  "PF-04 - POST Upload Dokumen-0" : {
    "transaction" : "PF-04 - POST Upload Dokumen-0",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1515.0,
    "medianResTime" : 1556.0,
    "minResTime" : 1374.0,
    "maxResTime" : 1564.0,
    "pct1ResTime" : 1564.0,
    "pct2ResTime" : 1564.0,
    "pct3ResTime" : 1564.0,
    "throughput" : 2.4764735017335315,
    "receivedKBytesPerSec" : 4.677245851906885,
    "sentKBytesPerSec" : 5.2523487803368
  },
  "PF-04 - POST Upload Dokumen-1" : {
    "transaction" : "PF-04 - POST Upload Dokumen-1",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2526.8,
    "medianResTime" : 2526.0,
    "minResTime" : 2480.0,
    "maxResTime" : 2576.0,
    "pct1ResTime" : 2576.0,
    "pct2ResTime" : 2576.0,
    "pct3ResTime" : 2576.0,
    "throughput" : 1.6874789065136686,
    "receivedKBytesPerSec" : 58.44642518140398,
    "sentKBytesPerSec" : 1.522686044549443
  },
  "PF-02 - GET Form Pra-Pendaftaran" : {
    "transaction" : "PF-02 - GET Form Pra-Pendaftaran",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1848.4,
    "medianResTime" : 2094.0,
    "minResTime" : 1021.0,
    "maxResTime" : 2307.0,
    "pct1ResTime" : 2307.0,
    "pct2ResTime" : 2307.0,
    "pct3ResTime" : 2307.0,
    "throughput" : 1.9171779141104295,
    "receivedKBytesPerSec" : 60.919077118481596,
    "sentKBytesPerSec" : 1.7374424846625767
  },
  "Step 1 - GET Login Page" : {
    "transaction" : "Step 1 - GET Login Page",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 731.4,
    "medianResTime" : 218.0,
    "minResTime" : 101.0,
    "maxResTime" : 2015.0,
    "pct1ResTime" : 2015.0,
    "pct2ResTime" : 2015.0,
    "pct3ResTime" : 2015.0,
    "throughput" : 1.2843565373747752,
    "receivedKBytesPerSec" : 11.327171766632418,
    "sentKBytesPerSec" : 0.22827430644746982
  },
  "PF-04 - POST Upload Dokumen" : {
    "transaction" : "PF-04 - POST Upload Dokumen",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4043.4,
    "medianResTime" : 4093.0,
    "minResTime" : 3855.0,
    "maxResTime" : 4098.0,
    "pct1ResTime" : 4098.0,
    "pct2ResTime" : 4098.0,
    "pct3ResTime" : 4098.0,
    "throughput" : 1.1111111111111112,
    "receivedKBytesPerSec" : 40.582248263888886,
    "sentKBytesPerSec" : 3.359157986111111
  },
  "Step 2 - POST Login Klien-2" : {
    "transaction" : "Step 2 - POST Login Klien-2",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2705.2,
    "medianResTime" : 2697.0,
    "minResTime" : 2671.0,
    "maxResTime" : 2738.0,
    "pct1ResTime" : 2738.0,
    "pct2ResTime" : 2738.0,
    "pct3ResTime" : 2738.0,
    "throughput" : 1.1676786548341895,
    "receivedKBytesPerSec" : 41.3796123306866,
    "sentKBytesPerSec" : 1.0433847355207846
  },
  "Step 2 - POST Login Klien" : {
    "transaction" : "Step 2 - POST Login Klien",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4811.8,
    "medianResTime" : 4848.0,
    "minResTime" : 4569.0,
    "maxResTime" : 5038.0,
    "pct1ResTime" : 5038.0,
    "pct2ResTime" : 5038.0,
    "pct3ResTime" : 5038.0,
    "throughput" : 0.77724234416291,
    "receivedKBytesPerSec" : 30.38835399502565,
    "sentKBytesPerSec" : 2.2102829162132753
  },
  "Step 2 - POST Login Klien-0" : {
    "transaction" : "Step 2 - POST Login Klien-0",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1283.8,
    "medianResTime" : 1327.0,
    "minResTime" : 1045.0,
    "maxResTime" : 1499.0,
    "pct1ResTime" : 1499.0,
    "pct2ResTime" : 1499.0,
    "pct3ResTime" : 1499.0,
    "throughput" : 1.7053206002728514,
    "receivedKBytesPerSec" : 3.0958896444406547,
    "sentKBytesPerSec" : 1.8119031377899046
  },
  "PF-05 - GET Monitoring Status" : {
    "transaction" : "PF-05 - GET Monitoring Status",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2498.0,
    "medianResTime" : 2505.0,
    "minResTime" : 2472.0,
    "maxResTime" : 2517.0,
    "pct1ResTime" : 2517.0,
    "pct2ResTime" : 2517.0,
    "pct3ResTime" : 2517.0,
    "throughput" : 1.7105713308244954,
    "receivedKBytesPerSec" : 58.429374786178585,
    "sentKBytesPerSec" : 1.5435233492986657
  },
  "Step 2 - POST Login Klien-1" : {
    "transaction" : "Step 2 - POST Login Klien-1",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 819.4,
    "medianResTime" : 819.0,
    "minResTime" : 811.0,
    "maxResTime" : 828.0,
    "pct1ResTime" : 828.0,
    "pct2ResTime" : 828.0,
    "pct3ResTime" : 828.0,
    "throughput" : 2.0584602717167555,
    "receivedKBytesPerSec" : 3.7972963410868674,
    "sentKBytesPerSec" : 1.8272855341704406
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 65,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2826.876923076923,
    "medianResTime" : 2526.0,
    "minResTime" : 101.0,
    "maxResTime" : 7258.0,
    "pct1ResTime" : 5034.4,
    "pct2ResTime" : 6920.4,
    "pct3ResTime" : 7258.0,
    "throughput" : 2.811175503849148,
    "receivedKBytesPerSec" : 63.23746898246259,
    "sentKBytesPerSec" : 4.556165394429548
  },
  "PF-03 - POST Formulir Perkara-1" : {
    "transaction" : "PF-03 - POST Formulir Perkara-1",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2973.4,
    "medianResTime" : 2848.0,
    "minResTime" : 2840.0,
    "maxResTime" : 3482.0,
    "pct1ResTime" : 3482.0,
    "pct2ResTime" : 3482.0,
    "pct3ResTime" : 3482.0,
    "throughput" : 1.4297969688304262,
    "receivedKBytesPerSec" : 44.79704702244781,
    "sentKBytesPerSec" : 1.2901683585930799
  },
  "PF-03 - POST Formulir Perkara-0" : {
    "transaction" : "PF-03 - POST Formulir Perkara-0",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4008.4,
    "medianResTime" : 4060.0,
    "minResTime" : 3773.0,
    "maxResTime" : 4083.0,
    "pct1ResTime" : 4083.0,
    "pct2ResTime" : 4083.0,
    "pct3ResTime" : 4083.0,
    "throughput" : 1.2201073694485114,
    "receivedKBytesPerSec" : 2.304382473157638,
    "sentKBytesPerSec" : 3.3824617191312836
  },
  "PF-03 - POST Formulir Perkara" : {
    "transaction" : "PF-03 - POST Formulir Perkara",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6984.4,
    "medianResTime" : 6927.0,
    "minResTime" : 6902.0,
    "maxResTime" : 7258.0,
    "pct1ResTime" : 7258.0,
    "pct2ResTime" : 7258.0,
    "pct3ResTime" : 7258.0,
    "throughput" : 0.6593696426216538,
    "receivedKBytesPerSec" : 21.90407923150468,
    "sentKBytesPerSec" : 2.422925870367928
  }
}